{"data":{"site":{"siteMetadata":{"title":"Blog by Eleanor Mollett","subtitle":"Delivery manager currently working for NICE in Manchester. Previously DWP, HMRC and the Home Office","copyright":"© All rights reserved Eleanor Mollett 2019.","menu":[{"label":"Blog","path":"/"},{"label":"Projects","path":"/projects/"},{"label":"Resources","path":"/resources/"}],"author":{"name":"Eleanor Mollett","twitter":"@eleanormollett","github":"emollett","linkedin":"eleanormollett"}}},"allMarkdownRemark":{"edges":[{"node":{"fields":{"slug":"/posts/radarban-roadmap/","categorySlug":"/categories/product-management/"},"frontmatter":{"title":"Radarban Roadmap","date":"2018-10-10","category":"Product Management","description":"The roadmaps I’ve seen before have tended to be linear, and have dates. This is the entire point in a roadmap for some people, but for me it is too restrictive if I am meant to be able to respond to changes and new priorities. Once you have a linear roadmap, people expect it to be followed and for things to turn up in exactly that order. This is even worse if there are dates on it, because they expect those things at exactly those times. (Again, this is probably why some people like them, but it doesn’t work if you are responding to what you are learning)."}}},{"node":{"fields":{"slug":"/posts/donald-rumsfeld-estimating/","categorySlug":"/categories/delivery/"},"frontmatter":{"title":"Donald Rumsfeld estimating","date":"2018-05-09","category":"Delivery","description":"For a long time, I have avoided estimation. I’ve generally found that story count and cycle time has served me well enough if I do need to provide forecasts, and I have only provided ‘how long might this particular feature take’ forecasts, rather than “when will I get all of this” forecasts of large numbers of features."}}},{"node":{"fields":{"slug":"/posts/balancing-long-term-vision/","categorySlug":"/categories/delivery/"},"frontmatter":{"title":"Balancing long term vision with short term delivery priorities","date":"2018-05-02","category":"Delivery","description":"I’ve been thinking recently about how our team balances the effort we put in to putting together designs for the long term vision for our service, with the work we need to do now to deliver our minimum viable product and the private beta of our service."}}},{"node":{"fields":{"slug":"/posts/reducing-time-in-queues/","categorySlug":"/categories/delivery/"},"frontmatter":{"title":"Reducing time spent in queues","date":"2017-07-26","category":"Delivery","description":"Many teams across DWP and government are now using kanban boards to visualise the work going on in their team. However, this is only one part of kanban. Whilst it is an important first stage to map out the flow work takes to delivery, and to visualise what work the team has going on, the main value of kanban comes in using it to then improve the flow of your work. The way kanban does this is through limiting work in progress. It is the most important aspect of kanban, but it is often neglected."}}},{"node":{"fields":{"slug":"/posts/types-of-work/","categorySlug":"/categories/delivery/"},"frontmatter":{"title":"Types of work on our kanban board","date":"2017-07-20","category":"Delivery","description":"One of the things that often gets discussed during our daily team stand up is whether a piece of work should be on our kanban board, and whether the work on the board accurately reflects what the team is working on. To get the most out of kanban, we should be reflecting all the work the team is doing on the board so that we can ensure that the work in progress limits are having the right impact, and improving the flow of delivery."}}},{"node":{"fields":{"slug":"/posts/why-we-walk-the-wall/","categorySlug":"/categories/delivery/"},"frontmatter":{"title":"Why we walk the wall rather than asking for individual updates","date":"2017-07-13","category":"Delivery","description":"My team started out using the standard stand up format of answering the 3 questions; What did I do yesterday?, What will I be doing today?, What are my blockers?. As a fairly large team we started finding this to be very repetitive."}}},{"node":{"fields":{"slug":"/posts/the-anatomy-of-our-kanban-board/","categorySlug":"/categories/delivery/"},"frontmatter":{"title":"The anatomy of our kanban board","date":"2017-07-05","category":"Delivery","description":"I previously wrote about the reasons my team is using kanban to organise our work. Here I go into further detail about how our board is set up and why."}}},{"node":{"fields":{"slug":"/posts/why-my-team-uses-kanban/","categorySlug":"/categories/delivery/"},"frontmatter":{"title":"Why my team uses kanban","date":"2017-06-30","category":"Delivery","description":"Using kanban has improved our visibility of what work is being done by the team, and prevented each stage of work on a feature from becoming uncoupled from each other."}}}]}},"pageContext":{"tag":"Agile"}}