{"data":{"site":{"siteMetadata":{"title":"Blog by Eleanor Mollett","subtitle":"Delivery manager currently working for NICE in Manchester. Previously DWP, HMRC and the Home Office","copyright":"© All rights reserved Eleanor Mollett 2019.","author":{"name":"Eleanor Mollett","twitter":"@eleanormollett"},"disqusShortname":"","url":"https://lumen.netlify.com"}},"markdownRemark":{"id":"4594f7b8-7752-5660-8d20-5ea6d5a8e909","html":"<p>I’ve been thinking recently about how our team balances the effort we put in to putting together designs for the long term vision for our service, with the work we need to do now to deliver our minimum viable product and the private beta of our service.</p>\n<p>We want to be able to look forwards and think about where we want to go so we can communicate this to stakeholders and other services we interact with, to build engagement and to make sure we don’t back ourselves into a corner by focusing only on our immediate delivery. However, we also want to make sure we don’t start fixing problems before we verify they exist, and that we balance the effort we put into this with our delivery work.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/b13028ce1c719d7632d696b70573b9ec/a3f82/balance.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 960px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 56.166666666666664%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAALABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAECBf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhADEAAAAe9NCoP/xAAWEAADAAAAAAAAAAAAAAAAAAAAASD/2gAIAQEAAQUCFP8A/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPwE//8QAFBABAAAAAAAAAAAAAAAAAAAAIP/aAAgBAQAGPwJf/8QAGRABAAMBAQAAAAAAAAAAAAAAAQAQMRFB/9oACAEBAAE/IUfGF5tOQyv/2gAMAwEAAgADAAAAEODP/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPxA//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPxA//8QAGhABAAIDAQAAAAAAAAAAAAAAARExABBRcf/aAAgBAQABPxBiKEWdwAWZFas8whArX//Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Balancing delivery and vision\"\n        title=\"Balancing delivery and vision\"\n        src=\"/static/b13028ce1c719d7632d696b70573b9ec/d564d/balance.jpg\"\n        srcset=\"/static/b13028ce1c719d7632d696b70573b9ec/865fd/balance.jpg 240w,\n/static/b13028ce1c719d7632d696b70573b9ec/d40a0/balance.jpg 480w,\n/static/b13028ce1c719d7632d696b70573b9ec/d564d/balance.jpg 960w,\n/static/b13028ce1c719d7632d696b70573b9ec/a3f82/balance.jpg 1200w\"\n        sizes=\"(max-width: 960px) 100vw, 960px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    \n<em>Balancing delivery and vision</em></p>\n<h2>Things I wanted to take into account before adding longer term design work into the team backlog</h2>\n<h3>How much do we want to do in advance?</h3>\n<ul>\n<li>Having an idea of where we might go will help us understand what we don’t know yet, and what we need to validate before we go in to further detail</li>\n<li>However we have to be careful we don’t introduce and accept features without verifying the user need, and we want to make sure we are able and free to adapt to feedback we receive during our user testing</li>\n<li>We all have time constraints, and don’t want to neglect delivery priorities</li>\n</ul>\n<h3>How do we want to communicate the longer term design work with the whole team?</h3>\n<ul>\n<li>We want to engage with the whole team and inspire better ideas by sharing our work. By having a shared understanding of the vision and what others are working on, individuals can have more autonomy in how they work towards the goal rather than working away at individual tasks.</li>\n<li>However, team members have previously indicated that they don’t want to expend too much effort or become distracted by getting too involved in work that isn’t immediately relevant to them</li>\n<li>We need to make sure when we feedback the work, we don’t get stuck on details — it will be a vision not a plan</li>\n</ul>\n<h3>How do we want to communicate the longer term design work to stakeholders?</h3>\n<ul>\n<li>Sharing our longer term vision can help us build relationships with users, and helps them get involved and invested in the work we are doing</li>\n<li>We can use this to recruit users to gather useful feedback on what does and doesn’t work for them, and validate the assumptions we are using</li>\n<li>This needs to be balanced with an understanding that these are long term ideas, and may never be realised. We need to be careful stakeholders understand the designs are concepts, and not exactly what they will get.</li>\n</ul>\n<h2>How I will introduce the work to the backlog</h2>\n<p>It is important to me that we track the work that is happening in the team (see <a href=\"/posts/types-of-work\">this earlier post</a>). To facilitate the work on longer term vision, I have introduced ‘concept cards’ to our kanban board. These are very high level, looking at things that are further off in the road map, and will go straight to the design team. We have agreed on a work in progress limit of 1 card on the board at any time so that the work on these is balanced with delivery capacity. Ideas from these will inform the questions we ask and the testing we do. They will be concepts, not plans, and will be highly likely to change before they get to the delivery stage, based on greater understanding of user needs from testing.</p>\n<p>To share the concepts with the team we are going to trial getting them up on the wall in the open, walking the team though them and then taking comments and questions on the concepts post-its to try to prevent us from discussing the details or implementation to closely, but this is a trial so we will continue to change this method based on how it goes.</p>\n<p>I am very interested in how other teams manage this balance, if you have any suggestions or examples please let me know!</p>","fields":{"tagSlugs":["/tags/delivery/","/tags/product-management/","/tags/agile/","/tags/kanban/","/tags/design/","/tags/development/"]},"frontmatter":{"title":"Balancing long term vision with short term delivery priorities","tags":["Delivery","Product Management","Agile","Kanban","Design","Development"],"date":"2018-05-02","description":"I’ve been thinking recently about how our team balances the effort we put in to putting together designs for the long term vision for our service, with the work we need to do now to deliver our minimum viable product and the private beta of our service."}}},"pageContext":{"slug":"/posts/balancing-long-term-vision/"}}